#### Terraform Plan 📖
<details><summary>Show Plan</summary>

```terraform
[command]/home/runner/work/_temp/0993e17e-543e-4371-bf44-2f6a64655fdb/terraform-bin plan -out=tfplan -no-color
module.s3_alb_logs.data.aws_partition.current: Reading...
module.s3_alb_logs.data.aws_caller_identity.current: Reading...
module.ecr.data.aws_partition.current: Reading...
module.s3_alb_logs.data.aws_region.current: Reading...
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-05686e7dc52f8f6df]
module.ecr.aws_ecr_repository.this[0]: Refreshing state... [id=aidoctors-app]
module.ecr.data.aws_caller_identity.current: Reading...
module.ecr.data.aws_partition.current: Read complete after 0s [id=aws]
module.s3_alb_logs.data.aws_region.current: Read complete after 0s [id=us-east-2]
module.s3_alb_logs.data.aws_partition.current: Read complete after 0s [id=aws]
module.ecr.data.aws_caller_identity.current: Read complete after 0s [id=521538197756]
module.ecr.data.aws_iam_policy_document.repository[0]: Reading...
module.ecr.data.aws_iam_policy_document.repository[0]: Read complete after 0s [id=1578471098]
module.s3_alb_logs.data.aws_caller_identity.current: Read complete after 0s [id=521538197756]
module.ecr.aws_ecr_lifecycle_policy.this[0]: Refreshing state... [id=aidoctors-app]
module.ecr.aws_ecr_repository_policy.this[0]: Refreshing state... [id=aidoctors-app]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-0fc63c4d494374dd6]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-043f4c0120570ae34]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-083c0db3e1395fded]
module.rds_security_group.aws_security_group.this_name_prefix[0]: Refreshing state... [id=sg-03ed752e073dfbab3]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-0032386130964171e]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-09431dd1309dfe33a]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-00181454359ad7fee]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0f5eb680acf65fea3]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-07bf335ed55e1233f]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0f7d82a180ace47f4]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-073019d7ba4d1ac80]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0c5b5757a4ad55762]
module.vpc.aws_subnet.database[1]: Refreshing state... [id=subnet-07efa2bcb551685bd]
module.vpc.aws_subnet.database[0]: Refreshing state... [id=subnet-0bf70d3f2fadcfb41]
module.vpc.aws_eip.nat[1]: Refreshing state... [id=eipalloc-038f6ff47eba184f5]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-030857cf79d386198]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0f7d82a180ace47f41080289494]
module.rds_security_group.aws_security_group_rule.ingress_with_cidr_blocks[0]: Refreshing state... [id=sgrule-3263409970]
module.rds_security_group.aws_security_group_rule.egress_with_cidr_blocks[0]: Refreshing state... [id=sgrule-3542370404]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0bbaf291468d476f3]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-08ce7f62a5a36df2c]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-060bb021411c4af84]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0c43d4e8b4f48b114]
module.vpc.aws_route_table_association.database[1]: Refreshing state... [id=rtbassoc-061c36c6e2b02f39c]
module.vpc.aws_route_table_association.database[0]: Refreshing state... [id=rtbassoc-073ba5a5e32dc7574]
module.vpc.aws_db_subnet_group.database[0]: Refreshing state... [id=aidoctors-vpc]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0e24a561bd9bff913]
module.vpc.aws_nat_gateway.this[1]: Refreshing state... [id=nat-060795adfd71d2087]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0f5eb680acf65fea31080289494]
module.vpc.aws_route.private_nat_gateway[1]: Refreshing state... [id=r-rtb-09431dd1309dfe33a1080289494]
module.db.module.db_instance.data.aws_partition.current: Reading...
module.db.module.db_instance.data.aws_iam_policy_document.enhanced_monitoring: Reading...
module.db.module.db_instance.data.aws_iam_policy_document.enhanced_monitoring: Read complete after 0s [id=76086537]
module.db.module.db_instance.data.aws_partition.current: Read complete after 0s [id=aws]
module.db.module.db_instance.aws_iam_role.enhanced_monitoring[0]: Refreshing state... [id=aidoctors-rds-monitoring-role]
module.db.module.db_instance.random_id.snapshot_identifier[0]: Refreshing state... [id=3ECwjw]
module.db.module.db_instance.aws_cloudwatch_log_group.this["upgrade"]: Refreshing state... [id=/aws/rds/instance/aidoctors-db/upgrade]
module.db.module.db_instance.aws_cloudwatch_log_group.this["postgresql"]: Refreshing state... [id=/aws/rds/instance/aidoctors-db/postgresql]
module.db.module.db_parameter_group.aws_db_parameter_group.this[0]: Refreshing state... [id=aidoctors-db-20251029162216762800000001]
module.db.module.db_instance.aws_iam_role_policy_attachment.enhanced_monitoring[0]: Refreshing state... [id=aidoctors-rds-monitoring-role/arn:aws:iam::aws:policy/service-role/AmazonRDSEnhancedMonitoringRole]
module.db.module.db_instance.aws_db_instance.this[0]: Refreshing state... [id=db-YUAZASCKMEEFMFFXGN37R4GCT4]
module.db.module.db_instance.aws_secretsmanager_secret_rotation.this[0]: Refreshing state... [id=arn:aws:secretsmanager:us-east-2:521538197756:secret:rds!db-cbfeed5f-8f40-443b-9729-9c3f489f3b09-uO760T]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.db.module.db_instance.aws_db_instance.this[0] has changed
  ~ resource "aws_db_instance" "this" {
      + domain_dns_ips                        = []
        id                                    = "db-YUAZASCKMEEFMFFXGN37R4GCT4"
        tags                                  = {
            "Name" = "aidoctors-postgres"
        }
        # (74 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # aws_iam_role.ecs_task_execution_role will be created
  + resource "aws_iam_role" "ecs_task_execution_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "aidoctors-ecs-task-execution-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Name" = "aidoctors-ecs-task-execution-role"
        }
      + tags_all              = {
          + "Name" = "aidoctors-ecs-task-execution-role"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role.ecs_task_role will be created
  + resource "aws_iam_role" "ecs_task_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "aidoctors-ecs-task-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Name" = "aidoctors-ecs-task-role"
        }
      + tags_all              = {
          + "Name" = "aidoctors-ecs-task-role"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role_policy.ecs_task_execution_ecr_policy will be created
  + resource "aws_iam_role_policy" "ecs_task_execution_ecr_policy" {
      + id          = (known after apply)
      + name        = "aidoctors-ecs-task-execution-ecr-policy"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ecr:GetAuthorizationToken",
                          + "ecr:BatchCheckLayerAvailability",
                          + "ecr:GetDownloadUrlForLayer",
                          + "ecr:BatchGetImage",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "logs:CreateLogGroup",
                          + "logs:CreateLogStream",
                          + "logs:PutLogEvents",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # aws_iam_role_policy.ecs_task_role_policy will be created
  + resource "aws_iam_role_policy" "ecs_task_role_policy" {
      + id          = (known after apply)
      + name        = "aidoctors-ecs-task-role-policy"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:CreateLogGroup",
                          + "logs:CreateLogStream",
                          + "logs:PutLogEvents",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "s3.*",
                          + "ecr.*",
                          + "ecs.*",
                          + "rds.*",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # aws_iam_role_policy_attachment.ecs_task_execution_role_policy will be created
  + resource "aws_iam_role_policy_attachment" "ecs_task_execution_role_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy"
      + role       = "aidoctors-ecs-task-execution-role"
    }

  # aws_route53_record.root will be created
  + resource "aws_route53_record" "root" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "aidoctors.com"
      + type            = "A"
      + zone_id         = (known after apply)

      + alias {
          + evaluate_target_health = true
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }
    }

  # aws_security_group.ecs_tasks will be created
  + resource "aws_security_group" "ecs_tasks" {
      + arn                    = (known after apply)
      + description            = "Security group for ECS tasks"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow all outbound traffic"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = []
              + description      = "Allow traffic from ALB"
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = (known after apply)
              + self             = false
              + to_port          = 80
            },
        ]
      + name                   = "aidoctors-ecs-tasks-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + region                 = "us-east-2"
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "aidoctors-ecs-tasks-sg"
        }
      + tags_all               = {
          + "Name" = "aidoctors-ecs-tasks-sg"
        }
      + vpc_id                 = "vpc-05686e7dc52f8f6df"
    }

  # module.acm.aws_acm_certificate.this[0] will be created
  + resource "aws_acm_certificate" "this" {
      + arn                       = (known after apply)
      + domain_name               = "aidoctors.com"
      + domain_validation_options = [
          + {
              + domain_name           = "*.aidoctors.com"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
          + {
              + domain_name           = "aidoctors.com"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + key_algorithm             = (known after apply)
      + not_after                 = (known after apply)
      + not_before                = (known after apply)
      + pending_renewal           = (known after apply)
      + region                    = "us-east-2"
      + renewal_eligibility       = (known after apply)
      + renewal_summary           = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = [
          + "*.aidoctors.com",
          + "aidoctors.com",
        ]
      + tags                      = {
          + "Name" = "aidoctors-certificate"
        }
      + tags_all                  = {
          + "Name" = "aidoctors-certificate"
        }
      + type                      = (known after apply)
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"

      + options {
          + certificate_transparency_logging_preference = "ENABLED"
          + export                                      = (known after apply)
        }
    }

  # module.acm.aws_acm_certificate_validation.this[0] will be created
  + resource "aws_acm_certificate_validation" "this" {
      + certificate_arn         = (known after apply)
      + id                      = (known after apply)
      + region                  = "us-east-2"
      + validation_record_fqdns = (known after apply)

      + timeouts {}
    }

  # module.acm.aws_route53_record.validation[0] will be created
  + resource "aws_route53_record" "validation" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = (known after apply)
    }

  # module.alb.data.aws_partition.current[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_partition" "current" {
      + dns_suffix         = (known after apply)
      + id                 = (known after apply)
      + partition          = (known after apply)
      + reverse_dns_prefix = (known after apply)
    }

  # module.alb.aws_lb.this[0] will be created
  + resource "aws_lb" "this" {
      + arn                                                          = (known after apply)
      + arn_suffix                                                   = (known after apply)
      + client_keep_alive                                            = 3600
      + desync_mitigation_mode                                       = "defensive"
      + dns_name                                                     = (known after apply)
      + drop_invalid_header_fields                                   = true
      + enable_deletion_protection                                   = true
      + enable_http2                                                 = true
      + enable_tls_version_and_cipher_suite_headers                  = false
      + enable_waf_fail_open                                         = false
      + enable_xff_client_port                                       = false
      + enable_zonal_shift                                           = false
      + enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)
      + id                                                           = (known after apply)
      + idle_timeout                                                 = 60
      + internal                                                     = (known after apply)
      + ip_address_type                                              = (known after apply)
      + load_balancer_type                                           = "application"
      + name                                                         = "aidoctors-alb"
      + name_prefix                                                  = (known after apply)
      + preserve_host_header                                         = false
      + region                                                       = "us-east-2"
      + secondary_ips_auto_assigned_per_subnet                       = (known after apply)
      + security_groups                                              = (known after apply)
      + subnets                                                      = [
          + "subnet-00181454359ad7fee",
          + "subnet-07bf335ed55e1233f",
        ]
      + tags                                                         = {
          + "Name"                  = "aidoctors-alb"
          + "terraform-aws-modules" = "alb"
        }
      + tags_all                                                     = {
          + "Name"                  = "aidoctors-alb"
          + "terraform-aws-modules" = "alb"
        }
      + vpc_id                                                       = (known after apply)
      + xff_header_processing_mode                                   = "append"
      + zone_id                                                      = (known after apply)

      + access_logs {
          + bucket  = (known after apply)
          + enabled = true
        }

      + subnet_mapping (known after apply)
    }

  # module.alb.aws_lb_listener.this["ex-http-https-redirect"] will be created
  + resource "aws_lb_listener" "this" {
      + arn                                                                   = (known after apply)
      + id                                                                    = (known after apply)
      + load_balancer_arn                                                     = (known after apply)
      + port                                                                  = 80
      + protocol                                                              = "HTTP"
      + region                                                                = "us-east-2"
      + routing_http_request_x_amzn_mtls_clientcert_header_name               = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_issuer_header_name        = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_leaf_header_name          = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_serial_number_header_name = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_subject_header_name       = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_validity_header_name      = (known after apply)
      + routing_http_request_x_amzn_tls_cipher_suite_header_name              = (known after apply)
      + routing_http_request_x_amzn_tls_version_header_name                   = (known after apply)
      + routing_http_response_access_control_allow_credentials_header_value   = (known after apply)
      + routing_http_response_access_control_allow_headers_header_value       = (known after apply)
      + routing_http_response_access_control_allow_methods_header_value       = (known after apply)
      + routing_http_response_access_control_allow_origin_header_value        = (known after apply)
      + routing_http_response_access_control_expose_headers_header_value      = (known after apply)
      + routing_http_response_access_control_max_age_header_value             = (known after apply)
      + routing_http_response_content_security_policy_header_value            = (known after apply)
      + routing_http_response_server_enabled                                  = (known after apply)
      + routing_http_response_strict_transport_security_header_value          = (known after apply)
      + routing_http_response_x_content_type_options_header_value             = (known after apply)
      + routing_http_response_x_frame_options_header_value                    = (known after apply)
      + ssl_policy                                                            = (known after apply)
      + tags                                                                  = {
          + "Name"                  = "aidoctors-alb"
          + "terraform-aws-modules" = "alb"
        }
      + tags_all                                                              = {
          + "Name"                  = "aidoctors-alb"
          + "terraform-aws-modules" = "alb"
        }
      + tcp_idle_timeout_seconds                                              = (known after apply)

      + default_action {
          + order = (known after apply)
          + type  = "redirect"

          + redirect {
              + host        = "#{host}"
              + path        = "/#{path}"
              + port        = "443"
              + protocol    = "HTTPS"
              + query       = "#{query}"
              + status_code = "HTTP_301"
            }
        }

      + mutual_authentication (known after apply)
    }

  # module.alb.aws_lb_listener.this["ex-https"] will be created
  + resource "aws_lb_listener" "this" {
      + arn                                                                   = (known after apply)
      + certificate_arn                                                       = (known after apply)
      + id                                                                    = (known after apply)
      + load_balancer_arn                                                     = (known after apply)
      + port                                                                  = 443
      + protocol                                                              = "HTTPS"
      + region                                                                = "us-east-2"
      + routing_http_request_x_amzn_mtls_clientcert_header_name               = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_issuer_header_name        = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_leaf_header_name          = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_serial_number_header_name = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_subject_header_name       = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_validity_header_name      = (known after apply)
      + routing_http_request_x_amzn_tls_cipher_suite_header_name              = (known after apply)
      + routing_http_request_x_amzn_tls_version_header_name                   = (known after apply)
      + routing_http_response_access_control_allow_credentials_header_value   = (known after apply)
      + routing_http_response_access_control_allow_headers_header_value       = (known after apply)
      + routing_http_response_access_control_allow_methods_header_value       = (known after apply)
      + routing_http_response_access_control_allow_origin_header_value        = (known after apply)
      + routing_http_response_access_control_expose_headers_header_value      = (known after apply)
      + routing_http_response_access_control_max_age_header_value             = (known after apply)
      + routing_http_response_content_security_policy_header_value            = (known after apply)
      + routing_http_response_server_enabled                                  = (known after apply)
      + routing_http_response_strict_transport_security_header_value          = (known after apply)
      + routing_http_response_x_content_type_options_header_value             = (known after apply)
      + routing_http_response_x_frame_options_header_value                    = (known after apply)
      + ssl_policy                                                            = "ELBSecurityPolicy-TLS13-1-3-2021-06"
      + tags                                                                  = {
          + "Name"                  = "aidoctors-alb"
          + "terraform-aws-modules" = "alb"
        }
      + tags_all                                                              = {
          + "Name"                  = "aidoctors-alb"
          + "terraform-aws-modules" = "alb"
        }
      + tcp_idle_timeout_seconds                                              = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }

      + mutual_authentication (known after apply)
    }

  # module.alb.aws_lb_target_group.this["aidoctors-application"] will be created
  + resource "aws_lb_target_group" "this" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "30"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancer_arns                 = (known after apply)
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_anomaly_mitigation  = (known after apply)
      + load_balancing_cross_zone_enabled  = "true"
      + name                               = (known after apply)
      + name_prefix                        = "aid"
      + port                               = 80
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + region                             = "us-east-2"
      + slow_start                         = 0
      + tags                               = {
          + "Name"                  = "aidoctors-alb"
          + "terraform-aws-modules" = "alb"
        }
      + tags_all                           = {
          + "Name"                  = "aidoctors-alb"
          + "terraform-aws-modules" = "alb"
        }
      + target_type                        = "ip"
      + vpc_id                             = "vpc-05686e7dc52f8f6df"

      + health_check {
          + enabled             = true
          + healthy_threshold   = 2
          + interval            = 30
          + matcher             = "200"
          + path                = "/"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 5
          + unhealthy_threshold = 3
        }

      + stickiness (known after apply)

      + target_failover (known after apply)

      + target_group_health (known after apply)

      + target_health_state (known after apply)
    }

  # module.alb.aws_security_group.this[0] will be created
  + resource "aws_security_group" "this" {
      + arn                    = (known after apply)
      + description            = "Security group for aidoctors-alb application load balancer"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "aidoctors-alb-"
      + owner_id               = (known after apply)
      + region                 = "us-east-2"
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name"                  = "aidoctors-alb"
          + "terraform-aws-modules" = "alb"
        }
      + tags_all               = {
          + "Name"                  = "aidoctors-alb"
          + "terraform-aws-modules" = "alb"
        }
      + vpc_id                 = "vpc-05686e7dc52f8f6df"
    }

  # module.alb.aws_vpc_security_group_egress_rule.this["all"] will be created
  + resource "aws_vpc_security_group_egress_rule" "this" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "10.0.0.0/16"
      + id                     = (known after apply)
      + ip_protocol            = "-1"
      + region                 = "us-east-2"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags                   = {
          + "Name" = "aidoctors-alb-all"
        }
      + tags_all               = {
          + "Name" = "aidoctors-alb-all"
        }
    }

  # module.alb.aws_vpc_security_group_ingress_rule.this["all_http"] will be created
  + resource "aws_vpc_security_group_ingress_rule" "this" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + description            = "HTTP web traffic"
      + from_port              = 80
      + id                     = (known after apply)
      + ip_protocol            = "tcp"
      + region                 = "us-east-2"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags                   = {
          + "Name" = "aidoctors-alb-all_http"
        }
      + tags_all               = {
          + "Name" = "aidoctors-alb-all_http"
        }
      + to_port                = 80
    }

  # module.alb.aws_vpc_security_group_ingress_rule.this["all_https"] will be created
  + resource "aws_vpc_security_group_ingress_rule" "this" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + description            = "HTTPS web traffic"
      + from_port              = 443
      + id                     = (known after apply)
      + ip_protocol            = "tcp"
      + region                 = "us-east-2"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags                   = {
          + "Name" = "aidoctors-alb-all_https"
        }
      + tags_all               = {
          + "Name" = "aidoctors-alb-all_https"
        }
      + to_port                = 443
    }

  # module.route53_zone.aws_route53_zone.this["aidoctors.com"] will be created
  + resource "aws_route53_zone" "this" {
      + arn                 = (known after apply)
      + comment             = "Hosted zone for AIDoctors application"
      + force_destroy       = false
      + id                  = (known after apply)
      + name                = "aidoctors.com"
      + name_servers        = (known after apply)
      + primary_name_server = (known after apply)
      + tags                = {
          + "Name" = "aidoctors-route53"
        }
      + tags_all            = {
          + "Name" = "aidoctors-route53"
        }
      + zone_id             = (known after apply)
    }

  # module.s3_alb_logs.data.aws_iam_policy_document.combined[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "combined" {
      + id                      = (known after apply)
      + json                    = (known after apply)
      + minified_json           = (known after apply)
      + source_policy_documents = (known after apply)
    }

  # module.s3_alb_logs.data.aws_iam_policy_document.elb_log_delivery[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "elb_log_delivery" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:PutObject",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
          + sid       = "ELBRegionUs-East-2"

          + principals {
              + identifiers = [
                  + "arn:aws:iam::033677994240:root",
                ]
              + type        = "AWS"
            }
        }
      + statement {
          + actions   = [
              + "s3:PutObject",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
            # (1 unchanged attribute hidden)

          + principals {
              + identifiers = [
                  + "logdelivery.elasticloadbalancing.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # module.s3_alb_logs.data.aws_iam_policy_document.lb_log_delivery[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lb_log_delivery" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:PutObject",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
          + sid       = "AlbNlbLogDeliveryWrite"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "bucket-owner-full-control",
                ]
              + variable = "s3:x-amz-acl"
            }

          + principals {
              + identifiers = [
                  + "delivery.logs.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
      + statement {
          + actions   = [
              + "s3:GetBucketAcl",
              + "s3:ListBucket",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
          + sid       = "AlbNlbLogDeliveryAclCheck"

          + principals {
              + identifiers = [
                  + "delivery.logs.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # module.s3_alb_logs.aws_s3_bucket.this[0] will be created
  + resource "aws_s3_bucket" "this" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "aidoctors-alb-logs"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_region               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = false
      + policy                      = (known after apply)
      + region                      = "us-east-2"
      + request_payer               = (known after apply)
      + tags                        = {
          + "Name"    = "aidoctors-alb-logs"
          + "Purpose" = "ALB Access Logs"
        }
      + tags_all                    = {
          + "Name"    = "aidoctors-alb-logs"
          + "Purpose" = "ALB Access Logs"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # module.s3_alb_logs.aws_s3_bucket_lifecycle_configuration.this[0] will be created
  + resource "aws_s3_bucket_lifecycle_configuration" "this" {
      + bucket                                 = (known after apply)
      + expected_bucket_owner                  = (known after apply)
      + id                                     = (known after apply)
      + region                                 = "us-east-2"
      + transition_default_minimum_object_size = "all_storage_classes_128K"

      + rule {
          + id     = "log-retention"
          + status = "Enabled"
            # (1 unchanged attribute hidden)

          + expiration {
              + days                         = 365
              + expired_object_delete_marker = false
            }

          + filter {
                # (1 unchanged attribute hidden)
            }

          + transition {
              + days          = 30
              + storage_class = "STANDARD_IA"
            }
          + transition {
              + days          = 90
              + storage_class = "GLACIER"
            }
        }
    }

  # module.s3_alb_logs.aws_s3_bucket_ownership_controls.this[0] will be created
  + resource "aws_s3_bucket_ownership_controls" "this" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + region = "us-east-2"

      + rule {
          + object_ownership = "ObjectWriter"
        }
    }

  # module.s3_alb_logs.aws_s3_bucket_policy.this[0] will be created
  + resource "aws_s3_bucket_policy" "this" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
      + region = "us-east-2"
    }

  # module.s3_alb_logs.aws_s3_bucket_public_access_block.this[0] will be created
  + resource "aws_s3_bucket_public_access_block" "this" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + region                  = "us-east-2"
      + restrict_public_buckets = true
      + skip_destroy            = true
    }

  # module.s3_alb_logs.aws_s3_bucket_server_side_encryption_configuration.this[0] will be created
  + resource "aws_s3_bucket_server_side_encryption_configuration" "this" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + region = "us-east-2"

      + rule {
          + apply_server_side_encryption_by_default {
              + sse_algorithm     = "AES256"
                # (1 unchanged attribute hidden)
            }
        }
    }

  # module.s3_alb_logs.aws_s3_bucket_versioning.this[0] will be created
  + resource "aws_s3_bucket_versioning" "this" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + region = "us-east-2"

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

Plan: 26 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"
::debug::Terraform exited with code 0.
::debug::stdout: module.s3_alb_logs.data.aws_partition.current: Reading...%0Amodule.s3_alb_logs.data.aws_caller_identity.current: Reading...%0Amodule.ecr.data.aws_partition.current: Reading...%0Amodule.s3_alb_logs.data.aws_region.current: Reading...%0Amodule.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-05686e7dc52f8f6df]%0Amodule.ecr.aws_ecr_repository.this[0]: Refreshing state... [id=aidoctors-app]%0Amodule.ecr.data.aws_caller_identity.current: Reading...%0Amodule.ecr.data.aws_partition.current: Read complete after 0s [id=aws]%0Amodule.s3_alb_logs.data.aws_region.current: Read complete after 0s [id=us-east-2]%0Amodule.s3_alb_logs.data.aws_partition.current: Read complete after 0s [id=aws]%0Amodule.ecr.data.aws_caller_identity.current: Read complete after 0s [id=521538197756]%0Amodule.ecr.data.aws_iam_policy_document.repository[0]: Reading...%0Amodule.ecr.data.aws_iam_policy_document.repository[0]: Read complete after 0s [id=1578471098]%0Amodule.s3_alb_logs.data.aws_caller_identity.current: Read complete after 0s [id=521538197756]%0Amodule.ecr.aws_ecr_lifecycle_policy.this[0]: Refreshing state... [id=aidoctors-app]%0Amodule.ecr.aws_ecr_repository_policy.this[0]: Refreshing state... [id=aidoctors-app]%0Amodule.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-0fc63c4d494374dd6]%0Amodule.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-043f4c0120570ae34]%0Amodule.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-083c0db3e1395fded]%0Amodule.rds_security_group.aws_security_group.this_name_prefix[0]: Refreshing state... [id=sg-03ed752e073dfbab3]%0Amodule.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-0032386130964171e]%0Amodule.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-09431dd1309dfe33a]%0Amodule.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-00181454359ad7fee]%0Amodule.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0f5eb680acf65fea3]%0Amodule.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-07bf335ed55e1233f]%0Amodule.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0f7d82a180ace47f4]%0Amodule.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-073019d7ba4d1ac80]%0Amodule.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0c5b5757a4ad55762]%0Amodule.vpc.aws_subnet.database[1]: Refreshing state... [id=subnet-07efa2bcb551685bd]%0Amodule.vpc.aws_subnet.database[0]: Refreshing state... [id=subnet-0bf70d3f2fadcfb41]%0Amodule.vpc.aws_eip.nat[1]: Refreshing state... [id=eipalloc-038f6ff47eba184f5]%0Amodule.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-030857cf79d386198]%0Amodule.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0f7d82a180ace47f41080289494]%0Amodule.rds_security_group.aws_security_group_rule.ingress_with_cidr_blocks[0]: Refreshing state... [id=sgrule-3263409970]%0Amodule.rds_security_group.aws_security_group_rule.egress_with_cidr_blocks[0]: Refreshing state... [id=sgrule-3542370404]%0Amodule.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0bbaf291468d476f3]%0Amodule.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-08ce7f62a5a36df2c]%0Amodule.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-060bb021411c4af84]%0Amodule.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0c43d4e8b4f48b114]%0Amodule.vpc.aws_route_table_association.database[1]: Refreshing state... [id=rtbassoc-061c36c6e2b02f39c]%0Amodule.vpc.aws_route_table_association.database[0]: Refreshing state... [id=rtbassoc-073ba5a5e32dc7574]%0Amodule.vpc.aws_db_subnet_group.database[0]: Refreshing state... [id=aidoctors-vpc]%0Amodule.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0e24a561bd9bff913]%0Amodule.vpc.aws_nat_gateway.this[1]: Refreshing state... [id=nat-060795adfd71d2087]%0Amodule.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0f5eb680acf65fea31080289494]%0Amodule.vpc.aws_route.private_nat_gateway[1]: Refreshing state... [id=r-rtb-09431dd1309dfe33a1080289494]%0Amodule.db.module.db_instance.data.aws_partition.current: Reading...%0Amodule.db.module.db_instance.data.aws_iam_policy_document.enhanced_monitoring: Reading...%0Amodule.db.module.db_instance.data.aws_iam_policy_document.enhanced_monitoring: Read complete after 0s [id=76086537]%0Amodule.db.module.db_instance.data.aws_partition.current: Read complete after 0s [id=aws]%0Amodule.db.module.db_instance.aws_iam_role.enhanced_monitoring[0]: Refreshing state... [id=aidoctors-rds-monitoring-role]%0Amodule.db.module.db_instance.random_id.snapshot_identifier[0]: Refreshing state... [id=3ECwjw]%0Amodule.db.module.db_instance.aws_cloudwatch_log_group.this["upgrade"]: Refreshing state... [id=/aws/rds/instance/aidoctors-db/upgrade]%0Amodule.db.module.db_instance.aws_cloudwatch_log_group.this["postgresql"]: Refreshing state... [id=/aws/rds/instance/aidoctors-db/postgresql]%0Amodule.db.module.db_parameter_group.aws_db_parameter_group.this[0]: Refreshing state... [id=aidoctors-db-20251029162216762800000001]%0Amodule.db.module.db_instance.aws_iam_role_policy_attachment.enhanced_monitoring[0]: Refreshing state... [id=aidoctors-rds-monitoring-role/arn:aws:iam::aws:policy/service-role/AmazonRDSEnhancedMonitoringRole]%0Amodule.db.module.db_instance.aws_db_instance.this[0]: Refreshing state... [id=db-YUAZASCKMEEFMFFXGN37R4GCT4]%0Amodule.db.module.db_instance.aws_secretsmanager_secret_rotation.this[0]: Refreshing state... [id=arn:aws:secretsmanager:us-east-2:521538197756:secret:rds!db-cbfeed5f-8f40-443b-9729-9c3f489f3b09-uO760T]%0A%0ANote: Objects have changed outside of Terraform%0A%0ATerraform detected the following changes made outside of Terraform since the%0Alast "terraform apply" which may have affected this plan:%0A%0A  # module.db.module.db_instance.aws_db_instance.this[0] has changed%0A  ~ resource "aws_db_instance" "this" {%0A      + domain_dns_ips                        = []%0A        id                                    = "db-YUAZASCKMEEFMFFXGN37R4GCT4"%0A        tags                                  = {%0A            "Name" = "aidoctors-postgres"%0A        }%0A        # (74 unchanged attributes hidden)%0A%0A        # (1 unchanged block hidden)%0A    }%0A%0A%0AUnless you have made equivalent changes to your configuration, or ignored the%0Arelevant attributes using ignore_changes, the following plan may include%0Aactions to undo or respond to these changes.%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A <= read (data resources)%0A%0ATerraform will perform the following actions:%0A%0A  # aws_iam_role.ecs_task_execution_role will be created%0A  + resource "aws_iam_role" "ecs_task_execution_role" {%0A      + arn                   = (known after apply)%0A      + assume_role_policy    = jsonencode(%0A            {%0A              + Statement = [%0A                  + {%0A                      + Action    = "sts:AssumeRole"%0A                      + Effect    = "Allow"%0A                      + Principal = {%0A                          + Service = "ecs-tasks.amazonaws.com"%0A                        }%0A                    },%0A                ]%0A              + Version   = "2012-10-17"%0A            }%0A        )%0A      + create_date           = (known after apply)%0A      + force_detach_policies = false%0A      + id                    = (known after apply)%0A      + managed_policy_arns   = (known after apply)%0A      + max_session_duration  = 3600%0A      + name                  = "aidoctors-ecs-task-execution-role"%0A      + name_prefix           = (known after apply)%0A      + path                  = "/"%0A      + tags                  = {%0A          + "Name" = "aidoctors-ecs-task-execution-role"%0A        }%0A      + tags_all              = {%0A          + "Name" = "aidoctors-ecs-task-execution-role"%0A        }%0A      + unique_id             = (known after apply)%0A%0A      + inline_policy (known after apply)%0A    }%0A%0A  # aws_iam_role.ecs_task_role will be created%0A  + resource "aws_iam_role" "ecs_task_role" {%0A      + arn                   = (known after apply)%0A      + assume_role_policy    = jsonencode(%0A            {%0A              + Statement = [%0A                  + {%0A                      + Action    = "sts:AssumeRole"%0A                      + Effect    = "Allow"%0A                      + Principal = {%0A                          + Service = "ecs-tasks.amazonaws.com"%0A                        }%0A                    },%0A                ]%0A              + Version   = "2012-10-17"%0A            }%0A        )%0A      + create_date           = (known after apply)%0A      + force_detach_policies = false%0A      + id                    = (known after apply)%0A      + managed_policy_arns   = (known after apply)%0A      + max_session_duration  = 3600%0A      + name                  = "aidoctors-ecs-task-role"%0A      + name_prefix           = (known after apply)%0A      + path                  = "/"%0A      + tags                  = {%0A          + "Name" = "aidoctors-ecs-task-role"%0A        }%0A      + tags_all              = {%0A          + "Name" = "aidoctors-ecs-task-role"%0A        }%0A      + unique_id             = (known after apply)%0A%0A      + inline_policy (known after apply)%0A    }%0A%0A  # aws_iam_role_policy.ecs_task_execution_ecr_policy will be created%0A  + resource "aws_iam_role_policy" "ecs_task_execution_ecr_policy" {%0A      + id          = (known after apply)%0A      + name        = "aidoctors-ecs-task-execution-ecr-policy"%0A      + name_prefix = (known after apply)%0A      + policy      = jsonencode(%0A            {%0A              + Statement = [%0A                  + {%0A                      + Action   = [%0A                          + "ecr:GetAuthorizationToken",%0A                          + "ecr:BatchCheckLayerAvailability",%0A                          + "ecr:GetDownloadUrlForLayer",%0A                          + "ecr:BatchGetImage",%0A                        ]%0A                      + Effect   = "Allow"%0A                      + Resource = "*"%0A                    },%0A                  + {%0A                      + Action   = [%0A                          + "logs:CreateLogGroup",%0A                          + "logs:CreateLogStream",%0A                          + "logs:PutLogEvents",%0A                        ]%0A                      + Effect   = "Allow"%0A                      + Resource = "*"%0A                    },%0A                ]%0A              + Version   = "2012-10-17"%0A            }%0A        )%0A      + role        = (known after apply)%0A    }%0A%0A  # aws_iam_role_policy.ecs_task_role_policy will be created%0A  + resource "aws_iam_role_policy" "ecs_task_role_policy" {%0A      + id          = (known after apply)%0A      + name        = "aidoctors-ecs-task-role-policy"%0A      + name_prefix = (known after apply)%0A      + policy      = jsonencode(%0A            {%0A              + Statement = [%0A                  + {%0A                      + Action   = [%0A                          + "logs:CreateLogGroup",%0A                          + "logs:CreateLogStream",%0A                          + "logs:PutLogEvents",%0A                        ]%0A                      + Effect   = "Allow"%0A                      + Resource = "*"%0A                    },%0A                  + {%0A                      + Action   = [%0A                          + "s3.*",%0A                          + "ecr.*",%0A                          + "ecs.*",%0A                          + "rds.*",%0A                        ]%0A                      + Effect   = "Allow"%0A                      + Resource = "*"%0A                    },%0A                ]%0A              + Version   = "2012-10-17"%0A            }%0A        )%0A      + role        = (known after apply)%0A    }%0A%0A  # aws_iam_role_policy_attachment.ecs_task_execution_role_policy will be created%0A  + resource "aws_iam_role_policy_attachment" "ecs_task_execution_role_policy" {%0A      + id         = (known after apply)%0A      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy"%0A      + role       = "aidoctors-ecs-task-execution-role"%0A    }%0A%0A  # aws_route53_record.root will be created%0A  + resource "aws_route53_record" "root" {%0A      + allow_overwrite = (known after apply)%0A      + fqdn            = (known after apply)%0A      + id              = (known after apply)%0A      + name            = "aidoctors.com"%0A      + type            = "A"%0A      + zone_id         = (known after apply)%0A%0A      + alias {%0A          + evaluate_target_health = true%0A          + name                   = (known after apply)%0A          + zone_id                = (known after apply)%0A        }%0A    }%0A%0A  # aws_security_group.ecs_tasks will be created%0A  + resource "aws_security_group" "ecs_tasks" {%0A      + arn                    = (known after apply)%0A      + description            = "Security group for ECS tasks"%0A      + egress                 = [%0A          + {%0A              + cidr_blocks      = [%0A                  + "0.0.0.0/0",%0A                ]%0A              + description      = "Allow all outbound traffic"%0A              + from_port        = 0%0A              + ipv6_cidr_blocks = []%0A              + prefix_list_ids  = []%0A              + protocol         = "-1"%0A              + security_groups  = []%0A              + self             = false%0A              + to_port          = 0%0A            },%0A        ]%0A      + id                     = (known after apply)%0A      + ingress                = [%0A          + {%0A              + cidr_blocks      = []%0A              + description      = "Allow traffic from ALB"%0A              + from_port        = 80%0A              + ipv6_cidr_blocks = []%0A              + prefix_list_ids  = []%0A              + protocol         = "tcp"%0A              + security_groups  = (known after apply)%0A              + self             = false%0A              + to_port          = 80%0A            },%0A        ]%0A      + name                   = "aidoctors-ecs-tasks-sg"%0A      + name_prefix            = (known after apply)%0A      + owner_id               = (known after apply)%0A      + region                 = "us-east-2"%0A      + revoke_rules_on_delete = false%0A      + tags                   = {%0A          + "Name" = "aidoctors-ecs-tasks-sg"%0A        }%0A      + tags_all               = {%0A          + "Name" = "aidoctors-ecs-tasks-sg"%0A        }%0A      + vpc_id                 = "vpc-05686e7dc52f8f6df"%0A    }%0A%0A  # module.acm.aws_acm_certificate.this[0] will be created%0A  + resource "aws_acm_certificate" "this" {%0A      + arn                       = (known after apply)%0A      + domain_name               = "aidoctors.com"%0A      + domain_validation_options = [%0A          + {%0A              + domain_name           = "*.aidoctors.com"%0A              + resource_record_name  = (known after apply)%0A              + resource_record_type  = (known after apply)%0A              + resource_record_value = (known after apply)%0A            },%0A          + {%0A              + domain_name           = "aidoctors.com"%0A              + resource_record_name  = (known after apply)%0A              + resource_record_type  = (known after apply)%0A              + resource_record_value = (known after apply)%0A            },%0A        ]%0A      + id                        = (known after apply)%0A      + key_algorithm             = (known after apply)%0A      + not_after                 = (known after apply)%0A      + not_before                = (known after apply)%0A      + pending_renewal           = (known after apply)%0A      + region                    = "us-east-2"%0A      + renewal_eligibility       = (known after apply)%0A      + renewal_summary           = (known after apply)%0A      + status                    = (known after apply)%0A      + subject_alternative_names = [%0A          + "*.aidoctors.com",%0A          + "aidoctors.com",%0A        ]%0A      + tags                      = {%0A          + "Name" = "aidoctors-certificate"%0A        }%0A      + tags_all                  = {%0A          + "Name" = "aidoctors-certificate"%0A        }%0A      + type                      = (known after apply)%0A      + validation_emails         = (known after apply)%0A      + validation_method         = "DNS"%0A%0A      + options {%0A          + certificate_transparency_logging_preference = "ENABLED"%0A          + export                                      = (known after apply)%0A        }%0A    }%0A%0A  # module.acm.aws_acm_certificate_validation.this[0] will be created%0A  + resource "aws_acm_certificate_validation" "this" {%0A      + certificate_arn         = (known after apply)%0A      + id                      = (known after apply)%0A      + region                  = "us-east-2"%0A      + validation_record_fqdns = (known after apply)%0A%0A      + timeouts {}%0A    }%0A%0A  # module.acm.aws_route53_record.validation[0] will be created%0A  + resource "aws_route53_record" "validation" {%0A      + allow_overwrite = true%0A      + fqdn            = (known after apply)%0A      + id              = (known after apply)%0A      + name            = (known after apply)%0A      + records         = (known after apply)%0A      + ttl             = 60%0A      + type            = (known after apply)%0A      + zone_id         = (known after apply)%0A    }%0A%0A  # module.alb.data.aws_partition.current[0] will be read during apply%0A  # (depends on a resource or a module with changes pending)%0A <= data "aws_partition" "current" {%0A      + dns_suffix         = (known after apply)%0A      + id                 = (known after apply)%0A      + partition          = (known after apply)%0A      + reverse_dns_prefix = (known after apply)%0A    }%0A%0A  # module.alb.aws_lb.this[0] will be created%0A  + resource "aws_lb" "this" {%0A      + arn                                                          = (known after apply)%0A      + arn_suffix                                                   = (known after apply)%0A      + client_keep_alive                                            = 3600%0A      + desync_mitigation_mode                                       = "defensive"%0A      + dns_name                                                     = (known after apply)%0A      + drop_invalid_header_fields                                   = true%0A      + enable_deletion_protection                                   = true%0A      + enable_http2                                                 = true%0A      + enable_tls_version_and_cipher_suite_headers                  = false%0A      + enable_waf_fail_open                                         = false%0A      + enable_xff_client_port                                       = false%0A      + enable_zonal_shift                                           = false%0A      + enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)%0A      + id                                                           = (known after apply)%0A      + idle_timeout                                                 = 60%0A      + internal                                                     = (known after apply)%0A      + ip_address_type                                              = (known after apply)%0A      + load_balancer_type                                           = "application"%0A      + name                                                         = "aidoctors-alb"%0A      + name_prefix                                                  = (known after apply)%0A      + preserve_host_header                                         = false%0A      + region                                                       = "us-east-2"%0A      + secondary_ips_auto_assigned_per_subnet                       = (known after apply)%0A      + security_groups                                              = (known after apply)%0A      + subnets                                                      = [%0A          + "subnet-00181454359ad7fee",%0A          + "subnet-07bf335ed55e1233f",%0A        ]%0A      + tags                                                         = {%0A          + "Name"                  = "aidoctors-alb"%0A          + "terraform-aws-modules" = "alb"%0A        }%0A      + tags_all                                                     = {%0A          + "Name"                  = "aidoctors-alb"%0A          + "terraform-aws-modules" = "alb"%0A        }%0A      + vpc_id                                                       = (known after apply)%0A      + xff_header_processing_mode                                   = "append"%0A      + zone_id                                                      = (known after apply)%0A%0A      + access_logs {%0A          + bucket  = (known after apply)%0A          + enabled = true%0A        }%0A%0A      + subnet_mapping (known after apply)%0A    }%0A%0A  # module.alb.aws_lb_listener.this["ex-http-https-redirect"] will be created%0A  + resource "aws_lb_listener" "this" {%0A      + arn                                                                   = (known after apply)%0A      + id                                                                    = (known after apply)%0A      + load_balancer_arn                                                     = (known after apply)%0A      + port                                                                  = 80%0A      + protocol                                                              = "HTTP"%0A      + region                                                                = "us-east-2"%0A      + routing_http_request_x_amzn_mtls_clientcert_header_name               = (known after apply)%0A      + routing_http_request_x_amzn_mtls_clientcert_issuer_header_name        = (known after apply)%0A      + routing_http_request_x_amzn_mtls_clientcert_leaf_header_name          = (known after apply)%0A      + routing_http_request_x_amzn_mtls_clientcert_serial_number_header_name = (known after apply)%0A      + routing_http_request_x_amzn_mtls_clientcert_subject_header_name       = (known after apply)%0A      + routing_http_request_x_amzn_mtls_clientcert_validity_header_name      = (known after apply)%0A      + routing_http_request_x_amzn_tls_cipher_suite_header_name              = (known after apply)%0A      + routing_http_request_x_amzn_tls_version_header_name                   = (known after apply)%0A      + routing_http_response_access_control_allow_credentials_header_value   = (known after apply)%0A      + routing_http_response_access_control_allow_headers_header_value       = (known after apply)%0A      + routing_http_response_access_control_allow_methods_header_value       = (known after apply)%0A      + routing_http_response_access_control_allow_origin_header_value        = (known after apply)%0A      + routing_http_response_access_control_expose_headers_header_value      = (known after apply)%0A      + routing_http_response_access_control_max_age_header_value             = (known after apply)%0A      + routing_http_response_content_security_policy_header_value            = (known after apply)%0A      + routing_http_response_server_enabled                                  = (known after apply)%0A      + routing_http_response_strict_transport_security_header_value          = (known after apply)%0A      + routing_http_response_x_content_type_options_header_value             = (known after apply)%0A      + routing_http_response_x_frame_options_header_value                    = (known after apply)%0A      + ssl_policy                                                            = (known after apply)%0A      + tags                                                                  = {%0A          + "Name"                  = "aidoctors-alb"%0A          + "terraform-aws-modules" = "alb"%0A        }%0A      + tags_all                                                              = {%0A          + "Name"                  = "aidoctors-alb"%0A          + "terraform-aws-modules" = "alb"%0A        }%0A      + tcp_idle_timeout_seconds                                              = (known after apply)%0A%0A      + default_action {%0A          + order = (known after apply)%0A          + type  = "redirect"%0A%0A          + redirect {%0A              + host        = "#{host}"%0A              + path        = "/#{path}"%0A              + port        = "443"%0A              + protocol    = "HTTPS"%0A              + query       = "#{query}"%0A              + status_code = "HTTP_301"%0A            }%0A        }%0A%0A      + mutual_authentication (known after apply)%0A    }%0A%0A  # module.alb.aws_lb_listener.this["ex-https"] will be created%0A  + resource "aws_lb_listener" "this" {%0A      + arn                                                                   = (known after apply)%0A      + certificate_arn                                                       = (known after apply)%0A      + id                                                                    = (known after apply)%0A      + load_balancer_arn                                                     = (known after apply)%0A      + port                                                                  = 443%0A      + protocol                                                              = "HTTPS"%0A      + region                                                                = "us-east-2"%0A      + routing_http_request_x_amzn_mtls_clientcert_header_name               = (known after apply)%0A      + routing_http_request_x_amzn_mtls_clientcert_issuer_header_name        = (known after apply)%0A      + routing_http_request_x_amzn_mtls_clientcert_leaf_header_name          = (known after apply)%0A      + routing_http_request_x_amzn_mtls_clientcert_serial_number_header_name = (known after apply)%0A      + routing_http_request_x_amzn_mtls_clientcert_subject_header_name       = (known after apply)%0A      + routing_http_request_x_amzn_mtls_clientcert_validity_header_name      = (known after apply)%0A      + routing_http_request_x_amzn_tls_cipher_suite_header_name              = (known after apply)%0A      + routing_http_request_x_amzn_tls_version_header_name                   = (known after apply)%0A      + routing_http_response_access_control_allow_credentials_header_value   = (known after apply)%0A      + routing_http_response_access_control_allow_headers_header_value       = (known after apply)%0A      + routing_http_response_access_control_allow_methods_header_value       = (known after apply)%0A      + routing_http_response_access_control_allow_origin_header_value        = (known after apply)%0A      + routing_http_response_access_control_expose_headers_header_value      = (known after apply)%0A      + routing_http_response_access_control_max_age_header_value             = (known after apply)%0A      + routing_http_response_content_security_policy_header_value            = (known after apply)%0A      + routing_http_response_server_enabled                                  = (known after apply)%0A      + routing_http_response_strict_transport_security_header_value          = (known after apply)%0A      + routing_http_response_x_content_type_options_header_value             = (known after apply)%0A      + routing_http_response_x_frame_options_header_value                    = (known after apply)%0A      + ssl_policy                                                            = "ELBSecurityPolicy-TLS13-1-3-2021-06"%0A      + tags                                                                  = {%0A          + "Name"                  = "aidoctors-alb"%0A          + "terraform-aws-modules" = "alb"%0A        }%0A      + tags_all                                                              = {%0A          + "Name"                  = "aidoctors-alb"%0A          + "terraform-aws-modules" = "alb"%0A        }%0A      + tcp_idle_timeout_seconds                                              = (known after apply)%0A%0A      + default_action {%0A          + order            = (known after apply)%0A          + target_group_arn = (known after apply)%0A          + type             = "forward"%0A        }%0A%0A      + mutual_authentication (known after apply)%0A    }%0A%0A  # module.alb.aws_lb_target_group.this["aidoctors-application"] will be created%0A  + resource "aws_lb_target_group" "this" {%0A      + arn                                = (known after apply)%0A      + arn_suffix                         = (known after apply)%0A      + connection_termination             = (known after apply)%0A      + deregistration_delay               = "30"%0A      + id                                 = (known after apply)%0A      + ip_address_type                    = (known after apply)%0A      + lambda_multi_value_headers_enabled = false%0A      + load_balancer_arns                 = (known after apply)%0A      + load_balancing_algorithm_type      = (known after apply)%0A      + load_balancing_anomaly_mitigation  = (known after apply)%0A      + load_balancing_cross_zone_enabled  = "true"%0A      + name                               = (known after apply)%0A      + name_prefix                        = "aid"%0A      + port                               = 80%0A      + preserve_client_ip                 = (known after apply)%0A      + protocol                           = "HTTP"%0A      + protocol_version                   = (known after apply)%0A      + proxy_protocol_v2                  = false%0A      + region                             = "us-east-2"%0A      + slow_start                         = 0%0A      + tags                               = {%0A          + "Name"                  = "aidoctors-alb"%0A          + "terraform-aws-modules" = "alb"%0A        }%0A      + tags_all                           = {%0A          + "Name"                  = "aidoctors-alb"%0A          + "terraform-aws-modules" = "alb"%0A        }%0A      + target_type                        = "ip"%0A      + vpc_id                             = "vpc-05686e7dc52f8f6df"%0A%0A      + health_check {%0A          + enabled             = true%0A          + healthy_threshold   = 2%0A          + interval            = 30%0A          + matcher             = "200"%0A          + path                = "/"%0A          + port                = "traffic-port"%0A          + protocol            = "HTTP"%0A          + timeout             = 5%0A          + unhealthy_threshold = 3%0A        }%0A%0A      + stickiness (known after apply)%0A%0A      + target_failover (known after apply)%0A%0A      + target_group_health (known after apply)%0A%0A      + target_health_state (known after apply)%0A    }%0A%0A  # module.alb.aws_security_group.this[0] will be created%0A  + resource "aws_security_group" "this" {%0A      + arn                    = (known after apply)%0A      + description            = "Security group for aidoctors-alb application load balancer"%0A      + egress                 = (known after apply)%0A      + id                     = (known after apply)%0A      + ingress                = (known after apply)%0A      + name                   = (known after apply)%0A      + name_prefix            = "aidoctors-alb-"%0A      + owner_id               = (known after apply)%0A      + region                 = "us-east-2"%0A      + revoke_rules_on_delete = false%0A      + tags                   = {%0A          + "Name"                  = "aidoctors-alb"%0A          + "terraform-aws-modules" = "alb"%0A        }%0A      + tags_all               = {%0A          + "Name"                  = "aidoctors-alb"%0A          + "terraform-aws-modules" = "alb"%0A        }%0A      + vpc_id                 = "vpc-05686e7dc52f8f6df"%0A    }%0A%0A  # module.alb.aws_vpc_security_group_egress_rule.this["all"] will be created%0A  + resource "aws_vpc_security_group_egress_rule" "this" {%0A      + arn                    = (known after apply)%0A      + cidr_ipv4              = "10.0.0.0/16"%0A      + id                     = (known after apply)%0A      + ip_protocol            = "-1"%0A      + region                 = "us-east-2"%0A      + security_group_id      = (known after apply)%0A      + security_group_rule_id = (known after apply)%0A      + tags                   = {%0A          + "Name" = "aidoctors-alb-all"%0A        }%0A      + tags_all               = {%0A          + "Name" = "aidoctors-alb-all"%0A        }%0A    }%0A%0A  # module.alb.aws_vpc_security_group_ingress_rule.this["all_http"] will be created%0A  + resource "aws_vpc_security_group_ingress_rule" "this" {%0A      + arn                    = (known after apply)%0A      + cidr_ipv4              = "0.0.0.0/0"%0A      + description            = "HTTP web traffic"%0A      + from_port              = 80%0A      + id                     = (known after apply)%0A      + ip_protocol            = "tcp"%0A      + region                 = "us-east-2"%0A      + security_group_id      = (known after apply)%0A      + security_group_rule_id = (known after apply)%0A      + tags                   = {%0A          + "Name" = "aidoctors-alb-all_http"%0A        }%0A      + tags_all               = {%0A          + "Name" = "aidoctors-alb-all_http"%0A        }%0A      + to_port                = 80%0A    }%0A%0A  # module.alb.aws_vpc_security_group_ingress_rule.this["all_https"] will be created%0A  + resource "aws_vpc_security_group_ingress_rule" "this" {%0A      + arn                    = (known after apply)%0A      + cidr_ipv4              = "0.0.0.0/0"%0A      + description            = "HTTPS web traffic"%0A      + from_port              = 443%0A      + id                     = (known after apply)%0A      + ip_protocol            = "tcp"%0A      + region                 = "us-east-2"%0A      + security_group_id      = (known after apply)%0A      + security_group_rule_id = (known after apply)%0A      + tags                   = {%0A          + "Name" = "aidoctors-alb-all_https"%0A        }%0A      + tags_all               = {%0A          + "Name" = "aidoctors-alb-all_https"%0A        }%0A      + to_port                = 443%0A    }%0A%0A  # module.route53_zone.aws_route53_zone.this["aidoctors.com"] will be created%0A  + resource "aws_route53_zone" "this" {%0A      + arn                 = (known after apply)%0A      + comment             = "Hosted zone for AIDoctors application"%0A      + force_destroy       = false%0A      + id                  = (known after apply)%0A      + name                = "aidoctors.com"%0A      + name_servers        = (known after apply)%0A      + primary_name_server = (known after apply)%0A      + tags                = {%0A          + "Name" = "aidoctors-route53"%0A        }%0A      + tags_all            = {%0A          + "Name" = "aidoctors-route53"%0A        }%0A      + zone_id             = (known after apply)%0A    }%0A%0A  # module.s3_alb_logs.data.aws_iam_policy_document.combined[0] will be read during apply%0A  # (config refers to values not yet known)%0A <= data "aws_iam_policy_document" "combined" {%0A      + id                      = (known after apply)%0A      + json                    = (known after apply)%0A      + minified_json           = (known after apply)%0A      + source_policy_documents = (known after apply)%0A    }%0A%0A  # module.s3_alb_logs.data.aws_iam_policy_document.elb_log_delivery[0] will be read during apply%0A  # (config refers to values not yet known)%0A <= data "aws_iam_policy_document" "elb_log_delivery" {%0A      + id            = (known after apply)%0A      + json          = (known after apply)%0A      + minified_json = (known after apply)%0A%0A      + statement {%0A          + actions   = [%0A              + "s3:PutObject",%0A            ]%0A          + effect    = "Allow"%0A          + resources = [%0A              + (known after apply),%0A            ]%0A          + sid       = "ELBRegionUs-East-2"%0A%0A          + principals {%0A              + identifiers = [%0A                  + "arn:aws:iam::033677994240:root",%0A                ]%0A              + type        = "AWS"%0A            }%0A        }%0A      + statement {%0A          + actions   = [%0A              + "s3:PutObject",%0A            ]%0A          + effect    = "Allow"%0A          + resources = [%0A              + (known after apply),%0A            ]%0A            # (1 unchanged attribute hidden)%0A%0A          + principals {%0A              + identifiers = [%0A                  + "logdelivery.elasticloadbalancing.amazonaws.com",%0A                ]%0A              + type        = "Service"%0A            }%0A        }%0A    }%0A%0A  # module.s3_alb_logs.data.aws_iam_policy_document.lb_log_delivery[0] will be read during apply%0A  # (config refers to values not yet known)%0A <= data "aws_iam_policy_document" "lb_log_delivery" {%0A      + id            = (known after apply)%0A      + json          = (known after apply)%0A      + minified_json = (known after apply)%0A%0A      + statement {%0A          + actions   = [%0A              + "s3:PutObject",%0A            ]%0A          + effect    = "Allow"%0A          + resources = [%0A              + (known after apply),%0A            ]%0A          + sid       = "AlbNlbLogDeliveryWrite"%0A%0A          + condition {%0A              + test     = "StringEquals"%0A              + values   = [%0A                  + "bucket-owner-full-control",%0A                ]%0A              + variable = "s3:x-amz-acl"%0A            }%0A%0A          + principals {%0A              + identifiers = [%0A                  + "delivery.logs.amazonaws.com",%0A                ]%0A              + type        = "Service"%0A            }%0A        }%0A      + statement {%0A          + actions   = [%0A              + "s3:GetBucketAcl",%0A              + "s3:ListBucket",%0A            ]%0A          + effect    = "Allow"%0A          + resources = [%0A              + (known after apply),%0A            ]%0A          + sid       = "AlbNlbLogDeliveryAclCheck"%0A%0A          + principals {%0A              + identifiers = [%0A                  + "delivery.logs.amazonaws.com",%0A                ]%0A              + type        = "Service"%0A            }%0A        }%0A    }%0A%0A  # module.s3_alb_logs.aws_s3_bucket.this[0] will be created%0A  + resource "aws_s3_bucket" "this" {%0A      + acceleration_status         = (known after apply)%0A      + acl                         = (known after apply)%0A      + arn                         = (known after apply)%0A      + bucket                      = "aidoctors-alb-logs"%0A      + bucket_domain_name          = (known after apply)%0A      + bucket_prefix               = (known after apply)%0A      + bucket_region               = (known after apply)%0A      + bucket_regional_domain_name = (known after apply)%0A      + force_destroy               = false%0A      + hosted_zone_id              = (known after apply)%0A      + id                          = (known after apply)%0A      + object_lock_enabled         = false%0A      + policy                      = (known after apply)%0A      + region                      = "us-east-2"%0A      + request_payer               = (known after apply)%0A      + tags                        = {%0A          + "Name"    = "aidoctors-alb-logs"%0A          + "Purpose" = "ALB Access Logs"%0A        }%0A      + tags_all                    = {%0A          + "Name"    = "aidoctors-alb-logs"%0A          + "Purpose" = "ALB Access Logs"%0A        }%0A      + website_domain              = (known after apply)%0A      + website_endpoint            = (known after apply)%0A%0A      + cors_rule (known after apply)%0A%0A      + grant (known after apply)%0A%0A      + lifecycle_rule (known after apply)%0A%0A      + logging (known after apply)%0A%0A      + object_lock_configuration (known after apply)%0A%0A      + replication_configuration (known after apply)%0A%0A      + server_side_encryption_configuration (known after apply)%0A%0A      + versioning (known after apply)%0A%0A      + website (known after apply)%0A    }%0A%0A  # module.s3_alb_logs.aws_s3_bucket_lifecycle_configuration.this[0] will be created%0A  + resource "aws_s3_bucket_lifecycle_configuration" "this" {%0A      + bucket                                 = (known after apply)%0A      + expected_bucket_owner                  = (known after apply)%0A      + id                                     = (known after apply)%0A      + region                                 = "us-east-2"%0A      + transition_default_minimum_object_size = "all_storage_classes_128K"%0A%0A      + rule {%0A          + id     = "log-retention"%0A          + status = "Enabled"%0A            # (1 unchanged attribute hidden)%0A%0A          + expiration {%0A              + days                         = 365%0A              + expired_object_delete_marker = false%0A            }%0A%0A          + filter {%0A                # (1 unchanged attribute hidden)%0A            }%0A%0A          + transition {%0A              + days          = 30%0A              + storage_class = "STANDARD_IA"%0A            }%0A          + transition {%0A              + days          = 90%0A              + storage_class = "GLACIER"%0A            }%0A        }%0A    }%0A%0A  # module.s3_alb_logs.aws_s3_bucket_ownership_controls.this[0] will be created%0A  + resource "aws_s3_bucket_ownership_controls" "this" {%0A      + bucket = (known after apply)%0A      + id     = (known after apply)%0A      + region = "us-east-2"%0A%0A      + rule {%0A          + object_ownership = "ObjectWriter"%0A        }%0A    }%0A%0A  # module.s3_alb_logs.aws_s3_bucket_policy.this[0] will be created%0A  + resource "aws_s3_bucket_policy" "this" {%0A      + bucket = (known after apply)%0A      + id     = (known after apply)%0A      + policy = (known after apply)%0A      + region = "us-east-2"%0A    }%0A%0A  # module.s3_alb_logs.aws_s3_bucket_public_access_block.this[0] will be created%0A  + resource "aws_s3_bucket_public_access_block" "this" {%0A      + block_public_acls       = true%0A      + block_public_policy     = true%0A      + bucket                  = (known after apply)%0A      + id                      = (known after apply)%0A      + ignore_public_acls      = true%0A      + region                  = "us-east-2"%0A      + restrict_public_buckets = true%0A      + skip_destroy            = true%0A    }%0A%0A  # module.s3_alb_logs.aws_s3_bucket_server_side_encryption_configuration.this[0] will be created%0A  + resource "aws_s3_bucket_server_side_encryption_configuration" "this" {%0A      + bucket = (known after apply)%0A      + id     = (known after apply)%0A      + region = "us-east-2"%0A%0A      + rule {%0A          + apply_server_side_encryption_by_default {%0A              + sse_algorithm     = "AES256"%0A                # (1 unchanged attribute hidden)%0A            }%0A        }%0A    }%0A%0A  # module.s3_alb_logs.aws_s3_bucket_versioning.this[0] will be created%0A  + resource "aws_s3_bucket_versioning" "this" {%0A      + bucket = (known after apply)%0A      + id     = (known after apply)%0A      + region = "us-east-2"%0A%0A      + versioning_configuration {%0A          + mfa_delete = (known after apply)%0A          + status     = "Enabled"%0A        }%0A    }%0A%0APlan: 26 to add, 0 to change, 0 to destroy.%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ASaved the plan to: tfplan%0A%0ATo perform exactly these actions, run the following command to apply:%0A    terraform apply "tfplan"%0A
::debug::stderr: 
::debug::exitcode: 0

```

</details>

*Pusher: @TerryTian21, Action: `pull_request`, Workflow: `Terraform PR Check`*